; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v7 ?v4)
             (pred_6 ?v3 ?v1)
             (pred_10 ?v7 ?v1)
             (pred_1 ?v13 ?v7 )
	     (pred_7 ?v7)
             (pred_9 ?v9)
             (pred_4 ?v3)
             (pred_3 ?v1)
             (pred_11 ?v7)
             (pred_5 ?v3)
             (pred_2 ?v7)
             (pred_8 ))



(:action op_2
:parameters (?v6 ?v2 ?v10 ?v12)
:precondition (and (pred_9 ?v6) (pred_9 ?v2) (pred_4 ?v10) (pred_3 ?v12)
          (pred_12 ?v6 ?v2) (pred_6 ?v10 ?v12)
                   (pred_10 ?v2 ?v12) (pred_7 ?v6) 
                   (pred_11 ?v2) (pred_5 ?v10))
:effect (and  (pred_2 ?v2) (not (pred_11 ?v2))))


(:action op_5
:parameters (?v6 ?v5)
:precondition (and (pred_9 ?v6) (pred_9 ?v5)
               (pred_7 ?v6) (pred_12 ?v6 ?v5) (pred_2 ?v5))
:effect (and (pred_7 ?v5) (not (pred_7 ?v6))))

(:action op_3
:parameters (?v6 ?v10)
:precondition (and (pred_9 ?v6) (pred_4 ?v10) 
                  (pred_7 ?v6) (pred_1 ?v10 ?v6) (pred_8 ))
:effect (and (pred_5 ?v10)
   (not (pred_1 ?v10 ?v6)) (not (pred_8 ))))


(:action op_4
:parameters (?v6 ?v8 ?v11)
:precondition (and (pred_9 ?v6) (pred_4 ?v8) (pred_4 ?v11)
                  (pred_7 ?v6) (pred_5 ?v11) (pred_1 ?v8 ?v6))
:effect (and (pred_5 ?v8) (pred_1 ?v11 ?v6)
        (not (pred_5 ?v11)) (not (pred_1 ?v8 ?v6))))

(:action op_1
:parameters (?v6 ?v10)
:precondition (and (pred_9 ?v6) (pred_4 ?v10) 
                  (pred_7 ?v6) (pred_5 ?v10))
:effect (and (pred_8 ) (pred_1 ?v10 ?v6) (not (pred_5 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_11 obj_01 obj_14 obj_12 obj_16 obj_15 obj_18 obj_07 obj_06 obj_09 obj_02 obj_03 obj_05 obj_19 obj_10
    obj_13 obj_08
    obj_04 obj_20
    )

    (:init
       (pred_8)

       (pred_9 obj_17)
       (pred_9 obj_11)
       (pred_9 obj_01)
       (pred_9 obj_14)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_09)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_05)
       (pred_9 obj_19)
       (pred_9 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_20)

       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_11)
       (pred_12 obj_11 obj_16)
       (pred_12 obj_11 obj_01)
       (pred_12 obj_11 obj_17)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_01 obj_14)
       (pred_12 obj_01 obj_11)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_14 obj_01)
       (pred_12 obj_12 obj_07)
       (pred_12 obj_12 obj_16)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_16 obj_06)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_16 obj_11)
       (pred_12 obj_16 obj_12)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_15 obj_18)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_15)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_07 obj_06)
       (pred_12 obj_07 obj_12)
       (pred_12 obj_06 obj_05)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_06 obj_16)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_09 obj_02)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_09 obj_06)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_02 obj_09)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_05 obj_06)
       (pred_12 obj_05 obj_03)
       (pred_12 obj_19 obj_10)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_10 obj_19)
       (pred_11 obj_17)
       (pred_11 obj_09)
       (pred_10  obj_17 obj_13)
       (pred_10  obj_09 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_14)
       (pred_2 obj_12)
       (pred_2 obj_16)
       (pred_2 obj_15)
       (pred_2 obj_18)
       (pred_2 obj_07)
       (pred_2 obj_06)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_19)
       (pred_2 obj_10)

       (pred_6  obj_04 obj_13)
       (pred_6  obj_20 obj_08)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_20 obj_15)
       (pred_7 obj_02)
    )

    (:goal (and
       (pred_1 obj_04 obj_05)
    ))
(:constraints
  (always (not (pred_7 obj_19)))
)
)

; plan
1. (op_3 obj_02 obj_04)
   deleted: (pred_1 obj_04 obj_02) (pred_8)
   added: (pred_5 obj_04)
   goals met: 0 of 1
2. (op_5 obj_02 obj_18)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_18)
   goals met: 0 of 1
3. (op_5 obj_18 obj_15)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_15)
   goals met: 0 of 1
4. (op_5 obj_15 obj_16)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_16)
   goals met: 0 of 1
5. (op_5 obj_16 obj_06)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_06)
   goals met: 0 of 1
6. (op_5 obj_06 obj_05)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_05)
   goals met: 0 of 1
7. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_04)
   added: (pred_8) (pred_1 obj_04 obj_05)
   goals met: 1 of 1
